Revit 2024 API
BuiltInFailures.FamilyFailures.CannotChangeInstFam Property
 Can't change Instance's Family. Try changing Instance's Host to a Level first.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotChangeInstFam { get; }
Visual Basic
Public Shared ReadOnly Property CannotChangeInstFam As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotChangeInstFam {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace